# GetDuctSizeSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizeSettings..::..GetDuctSizeSettings Method
DuctSizeSettings Class See Also
---
Get the duct size settings of the project.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static DuctSizeSettings GetDuctSizeSettings(
	Document aDoc
)
```

Visual Basic
---
```text
Public Shared Function GetDuctSizeSettings ( _
	aDoc As Document _
) As DuctSizeSettings
```

Visual C++
---
```text
public:
static DuctSizeSettings^ GetDuctSizeSettings(
	Document^ aDoc
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The duct size settings of the project.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace